<a href="https://colab.research.google.com/github/Praveen-Progs-Hub-2018/MachineLearning_All_Algos_Guide/blob/master/lamda_funcs.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
#Refference link
#https://python.plainenglish.io/feature-engineering-with-map-apply-and-lambda-functions-in-pandas-454ec2048eed
import pandas as pd
import numpy as np
import datetime
numdays=5
base=datetime.date.today()
date_list=[base - datetime.timedelta(days=x) for x in range(numdays)]
random_a=np.random.randint(0, 100, size=numdays)
random_b=np.random.randint(0, 100, size=numdays)
df=pd.DataFrame({'date': date_list, 'a': random_a, 'b': random_b})

#---Funcs applicable
df['dow']     = df['date'].map(lambda x: x.weekday())
df['weekday'] = df['date'].map(lambda x: 'Y' if x.weekday()<5 else 'N')

df['total']=df[['a', 'b']].apply(lambda x: x['a']+x['b'], axis=1)
df.loc['sum']=df[['a', 'b']].apply(lambda x: x.sum(), axis=0)
df[['a', 'b']].rolling(window=2).apply(lambda x: np.mean([x.iloc[0], x.iloc[1]]))
df.groupby('weekday').apply(lambda x: x['total']/x['total'].sum())

         date   a   b
0  2021-11-24  24  16
1  2021-11-23  75  11
2  2021-11-22  15  47
3  2021-11-21  18  69
4  2021-11-20  34  49

In [14]:
#https://www.analyticsvidhya.com/blog/2020/03/what-are-lambda-functions-in-python/

df=pd.DataFrame({
    'id':[1,2,3,4,5],
    'name':['Jeremy','Frank','Janet','Ryan','Mary'],
    'age':[20,25,15,10,30],
    'income':[4000,7000,200,0,10000]
})
df

   id    name  age  income
0   1  Jeremy   20    4000
1   2   Frank   25    7000
2   3   Janet   15     200
3   4    Ryan   10       0
4   5    Mary   30   10000

In [15]:
df['age']=df['age'].apply(lambda x: x+3)
df

   id    name  age  income
0   1  Jeremy   23    4000
1   2   Frank   28    7000
2   3   Janet   18     200
3   4    Ryan   13       0
4   5    Mary   33   10000

In [16]:
df['age2']=df.apply(lambda x: x['age']+3,axis=1)
df

   id    name  age  income  age2
0   1  Jeremy   23    4000    26
1   2   Frank   28    7000    31
2   3   Janet   18     200    21
3   4    Ryan   13       0    16
4   5    Mary   33   10000    36

In [18]:
filter_elements  =list(filter(lambda x: x>18,df['age']))
filter_elements

[26, 31, 21, 36]

In [11]:
df[['a', 'b']].rolling(window=2).apply(lambda x: np.mean([x.iloc[0], x.iloc[1]]))
df

         a      b
0      NaN    NaN
1     49.5   13.5
2     45.0   29.0
3     16.5   58.0
4     26.0   59.0
sum  100.0  120.5

In [19]:
df

   id    name  age  income  age2
0   1  Jeremy   26    4000    26
1   2   Frank   31    7000    31
2   3   Janet   21     200    21
3   4    Ryan   16       0    16
4   5    Mary   36   10000    36

In [20]:
# 20% Increment in nre income2
df['income2']=list(map(lambda x: int(x+x*0.2),df['income']))
df

   id    name  age  income  age2  income2
0   1  Jeremy   26    4000    26     4800
1   2   Frank   31    7000    31     8400
2   3   Janet   21     200    21      240
3   4    Ryan   16       0    16        0
4   5    Mary   36   10000    36    12000

In [21]:
import functools
functools.reduce(lambda a,b: a+b,df['income'])

21200

In [23]:
df['category']=df['age'].apply(lambda x: 'Adult' if x>=18 else 'Child')
df

   id    name  age  income  age2  income2 category
0   1  Jeremy   26    4000    26     4800    Adult
1   2   Frank   31    7000    31     8400    Adult
2   3   Janet   21     200    21      240    Adult
3   4    Ryan   16       0    16        0    Child
4   5    Mary   36   10000    36    12000    Adult